In [51]:
#import the libraries
import pandas as pd
import scipy 
import numpy as np
from scipy import stats

In [ ]:
#Question4
#Ho=the defective % does not varies by centre
#H1=the defective %  varies by centre

In [52]:
# loading the file
df=pd.read_csv('Costomer+OrderForm.csv')
df

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [53]:
# replacing error with value 0 and defective with 1
df=df.replace(to_replace="Error Free",value=0)
df=df.replace(to_replace="Defective",value=1)
df

     Phillippines  Indonesia  Malta  India
0               0          0      1      0
1               0          0      0      1
2               0          1      1      0
3               0          0      0      0
4               0          0      1      0
..            ...        ...    ...    ...
295             0          0      0      0
296             0          0      0      0
297             0          0      1      0
298             0          0      0      0
299             0          1      1      0

[300 rows x 4 columns]

In [54]:
# checking for null values
df.isnull()

     Phillippines  Indonesia  Malta  India
0           False      False  False  False
1           False      False  False  False
2           False      False  False  False
3           False      False  False  False
4           False      False  False  False
..            ...        ...    ...    ...
295         False      False  False  False
296         False      False  False  False
297         False      False  False  False
298         False      False  False  False
299         False      False  False  False

[300 rows x 4 columns]

In [ ]:
# performing cross tabulation for all the possible combinations

In [55]:

count0=pd.crosstab(df["Phillippines"],df["Indonesia"])
count0

Indonesia       0   1
Phillippines
0             240  31
1              27   2

In [56]:
count1=pd.crosstab(df["Phillippines"],df["Malta"])
count1

Malta           0   1
Phillippines
0             244  27
1              25   4

In [57]:
count2=pd.crosstab(df["Phillippines"],df["India"])
count2

India           0   1
Phillippines
0             253  18
1              27   2

In [58]:
count3=pd.crosstab(df["Indonesia"],df["Malta"])
count3

Malta        0   1
Indonesia
0          245  22
1           24   9

In [59]:
count4=pd.crosstab(df["Indonesia"],df["India"])
count4

India        0   1
Indonesia
0          249  18
1           31   2

In [60]:
count5=pd.crosstab(df["Malta"],df["India"])
count5

India    0   1
Malta
0      249  20
1       31   0

In [ ]:
# applying chi square test on all the combinations

In [68]:
Chisquares_results=scipy.stats.chi2_contingency(count0)

Chi_square(0)=[['','Test Statistic','p-value'],['Sample Data',Chisquares_results[0],Chisquares_results[1]]]
Chi_square(0)

[['', 'Test Statistic', 'p-value'],
 ['Sample Data', 0.1856391005881107, 0.6665712150680798]]

In [69]:
Chisquares_results=scipy.stats.chi2_contingency(count1)

Chi_square(1)=[['','Test Statistic','p-value'],['Sample Data',Chisquares_results[0],Chisquares_results[1]]]
Chi_square(1)

[['', 'Test Statistic', 'p-value'],
 ['Sample Data', 0.1043743747062788, 0.7466420539639729]]

In [63]:
Chisquares_results=scipy.stats.chi2_contingency(count2)

Chi_square(2)=[['','Test Statistic','p-value'],['Sample Data',Chisquares_results[0],Chisquares_results[1]]]
Chi_square(2)

[['', 'Test Statistic', 'p-value'],
 ['Sample Data', 0.11520004362605207, 0.7342998926385209]]

In [64]:
Chisquares_results=scipy.stats.chi2_contingency(count3)

Chi_square(3)=[['','Test Statistic','p-value'],['Sample Data',Chisquares_results[0],Chisquares_results[1]]]
Chi_square(3)

[['', 'Test Statistic', 'p-value'],
 ['Sample Data', 9.52050868943337, 0.0020318825161213722]]

In [65]:
Chisquares_results=scipy.stats.chi2_contingency(count4)

Chi_square(4)=[['','Test Statistic','p-value'],['Sample Data',Chisquares_results[0],Chisquares_results[1]]]
Chi_square(4)

[['', 'Test Statistic', 'p-value'],
 ['Sample Data', 0.049248504304684096, 0.8243761295490989]]

In [66]:
Chisquares_results=scipy.stats.chi2_contingency(count5)

Chi_square=[['','Test Statistic','p-value'],['Sample Data',Chisquares_results[0],Chisquares_results[1]]]
Chi_square

[['', 'Test Statistic', 'p-value'],
 ['Sample Data', 1.419106436194816, 0.23355053527979247]]

In [84]:
# we find the p_value of count3 is 0.00203 which is less than 0.05 and hence there is significant variation in the defective percentage between indonesia and malta

In [ ]:
#question1
#Ho=there is no significant difference
#H1=there is significant difference

In [70]:
cutlets=pd.read_csv('Cutlets.csv')
cutlets

    Unit A  Unit B
0   6.8090  6.7703
1   6.4376  7.5093
2   6.9157  6.7300
3   7.3012  6.7878
4   7.4488  7.1522
5   7.3871  6.8110
6   6.8755  7.2212
7   7.0621  6.6606
8   6.6840  7.2402
9   6.8236  7.0503
10  7.3930  6.8810
11  7.5169  7.4059
12  6.9246  6.7652
13  6.9256  6.0380
14  6.5797  7.1581
15  6.8394  7.0240
16  6.5970  6.6672
17  7.2705  7.4314
18  7.2828  7.3070
19  7.3495  6.7478
20  6.9438  6.8889
21  7.1560  7.4220
22  6.5341  6.5217
23  7.2854  7.1688
24  6.9952  6.7594
25  6.8568  6.9399
26  7.2163  7.0133
27  6.6801  6.9182
28  6.9431  6.3346
29  7.0852  7.5459
30  6.7794  7.0992
31  7.2783  7.1180
32  7.1561  6.6965
33  7.3943  6.5780
34  6.9405  7.3875

In [73]:
A=pd.Series(cutlets['Unit A'])
B=pd.Series(cutlets['Unit B'])

In [74]:
stats.ttest_ind(A,B)

Ttest_indResult(statistic=0.7228688704678061, pvalue=0.4722394724599501)

In [ ]:
# since pvalue>0.05 accept null hypothesis
# there is no significant difference in the diameters of unitA and unitB

In [ ]:
#question2
#Ho=All proportions are equal
#H1=Not all Proportions are equal

In [75]:
# loading the data
buyer=pd.read_csv('BuyerRatio.csv')
buyer

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [80]:
A=pd.Series(buyer.iloc[0,1:5])
B=pd.Series(buyer.iloc[1,1:5])

In [81]:
stats.ttest_ind(A,B)

Ttest_indResult(statistic=-3.5844638979607404, pvalue=0.011580726207478622)

In [ ]:
# since pvalue<0.05 accept alternate hypothesis
##H1=Not all Proportions are equal

In [ ]:
# question3
# H0- there is no difference in avg TAT
# H1- there is difference in average TAT

In [82]:
lab=pd.read_csv('LabTAT.csv')
lab

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

In [83]:
stats.f_oneway(lab.iloc[:,0], lab.iloc[:,1],lab.iloc[:,2],lab.iloc[:,3])

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

In [ ]:
# since pvalue<0.05 accept alternate hypothesis